Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# settings.app.fileEditorSyntaxHighlighting.subtitle
source: Color keywords, strings, and other tokens in the built-in file editor.
ar: لوّن الكلمات المفتاحية والسلاسل والرموز الأخرى في محرر الملفات المدمج.
bs: Oboji ključne riječi, stringove i ostale tokene u ugrađenom uređivaču datoteka.
da: Farvelæg nøgleord, strenge og andre tokens i den indbyggede fileditor.
de: Färbt Schlüsselwörter, Zeichenfolgen und andere Token im integrierten Dateieditor ein.
es: Colorea palabras clave, cadenas y otros tokens en el editor de archivos integrado.
fr: Colorie les mots-clés, chaînes et autres jetons dans l’éditeur de fichiers intégré.
it: Colora parole chiave, stringhe e altri token nell’editor di file integrato.
ja: 組み込みファイルエディタでキーワードや文字列などのトークンに色を付けます。
ko: 내장 파일 편집기에서 키워드, 문자열 및 기타 토큰에 색을 입힙니다.
nb: Farger nøkkelord, strenger og andre token i den innebygde fileditoren.
pl: Koloruje słowa kluczowe, ciągi i inne tokeny we wbudowanym edytorze plików.
pt_br: Colore palavras-chave, strings e outros tokens no editor de arquivos integrado.
ru: Раскрашивает ключевые слова, строки и другие токены во встроенном редакторе файлов.
th: ใส่สีคำสำคัญ สตริง และโทเค็นอื่นในตัวแก้ไขไฟล์ในตัว
tr: Yerleşik dosya düzenleyicide anahtar sözcükleri, dizeleri ve diğer jetonları renklendirir.
uk: Розфарбовує ключові слова, рядки та інші токени у вбудованому редакторі файлів.
zh_hans: 在内置文件编辑器中为关键字、字符串和其他标记着色。
zh_hant: 在內建檔案編輯器中為關鍵字、字串與其他標記上色。

# settings.app.fileEditorTabWidth
source: File Editor Tab Width
ar: عرض علامة التبويب في محرر الملفات
bs: Širina taba u uređivaču datoteka
da: Tabulatorbredde i fileditor
de: Tabulatorbreite im Dateieditor
es: Ancho de tabulación del editor de archivos
fr: Largeur de tabulation de l’éditeur de fichiers
it: Larghezza tabulazione nell’editor di file
ja: ファイルエディタのタブ幅
ko: 파일 편집기 탭 너비
nb: Tabulatorbredde i fileditor
pl: Szerokość tabulacji w edytorze plików
pt_br: Largura da tabulação do editor de arquivos
ru: Ширина табуляции в редакторе файлов
th: ความกว้างแท็บในตัวแก้ไขไฟล์
tr: Dosya düzenleyici sekme genişliği
uk: Ширина табуляції в редакторі файлів
zh_hans: 文件编辑器制表符宽度
zh_hant: 檔案編輯器定位點寬度

# settings.app.fileEditorTabWidth.subtitle
source: Columns per tab stop, used by indent guides.
ar: عدد الأعمدة لكل علامة تبويب، وتستخدمه أدلة المسافة البادئة.
bs: Broj stupaca po tabu, koriste ga vodiči uvlačenja.
da: Kolonner pr. tabulatorstop, bruges af indrykningsguides.
de: Spalten pro Tabstopp, genutzt von den Einzugshilfslinien.
es: Columnas por tabulación; las usan las guías de sangría.
fr: Colonnes par tabulation, utilisées par les guides d’indentation.
it: Colonne per tabulazione, usate dalle guide di indentazione.
ja: インデントガイドで使うタブ幅（桁数）です。
ko: 탭 정지당 열 수이며 들여쓰기 안내선이 사용합니다.
nb: Kolonner per tabulatorstopp, brukt av innrykksguider.
pl: Liczba kolumn na tabulację, używana przez prowadnice wcięć.
pt_br: Colunas por tabulação, usadas pelas guias de recuo.
ru: Число столбцов на табуляцию; используется направляющими отступа.
th: จำนวนคอลัมน์ต่อแท็บ เส้นนำการเยื้องใช้ค่านี้
tr: Sekme durağındaki sütun sayısı; girinti kılavuzları bunu kullanır.
uk: Кількість стовпців на табуляцію; використовують напрямні відступу.
zh_hans: 每个制表位的列数，缩进参考线会用到。
zh_hant: 每個定位點的欄數，縮排參考線會用到。

# settings.search.alias.setting.app.file-editor-current-line-highlight
source: fileEditor.currentLineHighlight current line caret
ar: fileEditor.currentLineHighlight current line caret fileEditor.currentLineHighlight السطر الحالي المؤشر
bs: fileEditor.currentLineHighlight trenutni red karet
da: fileEditor.currentLineHighlight aktuel linje indsætningspunkt
de: fileEditor.currentLineHighlight current line caret fileEditor.currentLineHighlight aktuelle zeile einfügemarke
es: fileEditor.currentLineHighlight current line caret fileEditor.currentLineHighlight línea actual cursor
fr: fileEditor.currentLineHighlight current line caret fileEditor.currentLineHighlight ligne active curseur
it: fileEditor.currentLineHighlight riga corrente cursore
ja: fileEditor.currentLineHighlight current line caret fileEditor.currentLineHighlight カレント行 キャレット
ko: fileEditor.currentLineHighlight current line caret fileEditor.currentLineHighlight 현재 줄 캐럿
nb: fileEditor.currentLineHighlight gjeldende linje innsettingspunkt
pl: fileEditor.currentLineHighlight bieżący wiersz karetka
pt_br: fileEditor.currentLineHighlight linha atual cursor
ru: fileEditor.currentLineHighlight текущая строка каретка
th: fileEditor.currentLineHighlight บรรทัดปัจจุบัน แคร์เรต
tr: fileEditor.currentLineHighlight geçerli satır imleç
uk: fileEditor.currentLineHighlight поточний рядок каретка
zh_hans: fileEditor.currentLineHighlight current line caret fileEditor.currentLineHighlight 当前行 插入点
zh_hant: fileEditor.currentLineHighlight current line caret fileEditor.currentLineHighlight 目前行 插入點

# settings.search.alias.setting.app.file-editor-indent-guides
source: fileEditor.indentGuides indent guides columns
ar: fileEditor.indentGuides indent guides columns fileEditor.indentGuides أدلة مسافة بادئة أعمدة
bs: fileEditor.indentGuides uvlačenje vodiči stupci
da: fileEditor.indentGuides indrykning guides kolonner
de: fileEditor.indentGuides indent guides columns fileEditor.indentGuides einzug hilfslinien spalten
es: fileEditor.indentGuides indent guides columns fileEditor.indentGuides sangría guías columnas
fr: fileEditor.indentGuides indent guides columns fileEditor.indentGuides indentation guides colonnes
it: fileEditor.indentGuides indentazione guide colonne
ja: fileEditor.indentGuides indent guides columns fileEditor.indentGuides インデント ガイド
ko: fileEditor.indentGuides indent guides columns fileEditor.indentGuides 들여쓰기 안내선 열
nb: fileEditor.indentGuides innrykk guider kolonner
pl: fileEditor.indentGuides wcięcia prowadnice kolumny
pt_br: fileEditor.indentGuides recuo guias colunas
ru: fileEditor.indentGuides отступ направляющие столбцы
th: fileEditor.indentGuides เยื้อง เส้นนำ คอลัมน์
tr: fileEditor.indentGuides girinti kılavuzlar sütunlar
uk: fileEditor.indentGuides відступ напрямні стовпці
zh_hans: fileEditor.indentGuides indent guides columns fileEditor.indentGuides 缩进 参考线 列
zh_hant: fileEditor.indentGuides indent guides columns fileEditor.indentGuides 縮排 參考線 欄

# settings.search.alias.setting.app.file-editor-line-numbers
source: fileEditor.lineNumbers gutter line numbers
ar: fileEditor.lineNumbers gutter line numbers fileEditor.lineNumbers هامش أرقام أسطر
bs: fileEditor.lineNumbers žlijeb brojevi redova
da: fileEditor.lineNumbers gutter linjenumre
de: fileEditor.lineNumbers gutter line numbers fileEditor.lineNumbers gutter zeilennummern
es: fileEditor.lineNumbers gutter line numbers fileEditor.lineNumbers margen números de línea
fr: fileEditor.lineNumbers gutter line numbers fileEditor.lineNumbers gouttière numéros de ligne
it: fileEditor.lineNumbers gutter numeri di riga
ja: fileEditor.lineNumbers gutter line numbers fileEditor.lineNumbers ガター 行番号
ko: fileEditor.lineNumbers gutter line numbers fileEditor.lineNumbers 여백 줄 번호
nb: fileEditor.lineNumbers gutter linjenumre
pl: fileEditor.lineNumbers rynienka numery wierszy
pt_br: fileEditor.lineNumbers calha números de linha
ru: fileEditor.lineNumbers поле номера строк
th: fileEditor.lineNumbers แถบ เลขบรรทัด
tr: fileEditor.lineNumbers oluk satır numaraları
uk: fileEditor.lineNumbers жолоб номери рядків
zh_hans: fileEditor.lineNumbers gutter line numbers fileEditor.lineNumbers 行号槽 行号
zh_hant: fileEditor.lineNumbers gutter line numbers fileEditor.lineNumbers 行號欄 行號

# settings.search.alias.setting.app.file-editor-syntax-highlighting
source: fileEditor.syntaxHighlighting syntax highlight colors tokens code
ar: fileEditor.syntaxHighlighting syntax highlight colors tokens code fileEditor.syntaxHighlighting تمييز بناء جملة ألوان رموز كود
bs: fileEditor.syntaxHighlighting sintaksa isticanje boje tokeni kod
da: fileEditor.syntaxHighlighting syntaks fremhævning farver tokens kode
de: fileEditor.syntaxHighlighting syntax highlight colors tokens code fileEditor.syntaxHighlighting syntax hervorhebung farben token code
es: fileEditor.syntaxHighlighting syntax highlight colors tokens code fileEditor.syntaxHighlighting sintaxis resaltado colores tokens código
fr: fileEditor.syntaxHighlighting syntax highlight colors tokens code fileEditor.syntaxHighlighting syntaxe coloration couleurs jetons code
it: fileEditor.syntaxHighlighting sintassi evidenziazione colori token codice
ja: fileEditor.syntaxHighlighting syntax highlight colors tokens code fileEditor.syntaxHighlighting シンタックス ハイライト 色 トークン コード
ko: fileEditor.syntaxHighlighting syntax highlight colors tokens code fileEditor.syntaxHighlighting 구문 강조 색 토큰 코드
nb: fileEditor.syntaxHighlighting syntaks utheving farger token kode
pl: fileEditor.syntaxHighlighting składnia podświetlanie kolory tokeny kod
pt_br: fileEditor.syntaxHighlighting sintaxe realce cores tokens código
ru: fileEditor.syntaxHighlighting синтаксис подсветка цвета токены код
th: fileEditor.syntaxHighlighting ไวยากรณ์ เน้น สี โทเค็น โค้ด
tr: fileEditor.syntaxHighlighting sözdizimi vurgu renkler jeton kod
uk: fileEditor.syntaxHighlighting синтаксис підсвічування кольори токени код
zh_hans: fileEditor.syntaxHighlighting syntax highlight colors tokens code fileEditor.syntaxHighlighting 语法 高亮 颜色 标记 代码
zh_hant: fileEditor.syntaxHighlighting syntax highlight colors tokens code fileEditor.syntaxHighlighting 語法 醒目提示 顏色 標記 程式碼

# settings.search.alias.setting.app.file-editor-tab-width
source: fileEditor.tabWidth tab width indent columns
ar: fileEditor.tabWidth tab width indent columns fileEditor.tabWidth عرض التبويب مسافة بادئة أعمدة
bs: fileEditor.tabWidth širina taba uvlačenje stupci
da: fileEditor.tabWidth tabulatorbredde indrykning kolonner
de: fileEditor.tabWidth tab width indent columns fileEditor.tabWidth tabulatorbreite einzug spalten
es: fileEditor.tabWidth tab width indent columns fileEditor.tabWidth ancho tabulación sangría columnas
fr: fileEditor.tabWidth tab width indent columns fileEditor.tabWidth largeur tabulation indentation colonnes
it: fileEditor.tabWidth larghezza tabulazione indentazione colonne
ja: fileEditor.tabWidth tab width indent columns fileEditor.tabWidth タブ幅 インデント
ko: fileEditor.tabWidth tab width indent columns fileEditor.tabWidth 탭 너비 들여쓰기
nb: fileEditor.tabWidth tabulatorbredde innrykk kolonner
pl: fileEditor.tabWidth szerokość tabulacji wcięcia kolumny
pt_br: fileEditor.tabWidth largura tabulação recuo colunas
ru: fileEditor.tabWidth ширина табуляции отступ столбцы
th: fileEditor.tabWidth ความกว้างแท็บ เยื้อง คอลัมน์
tr: fileEditor.tabWidth sekme genişliği girinti sütunlar
uk: fileEditor.tabWidth ширина табуляції відступ стовпці
zh_hans: fileEditor.tabWidth tab width indent columns fileEditor.tabWidth 制表符宽度 缩进 列
zh_hant: fileEditor.tabWidth tab width indent columns fileEditor.tabWidth 定位點寬度 縮排 欄

# settings.search.fileEditor.wordWrap
source: file editor word wrap soft wrap reflow lines text horizontal scroll preview
ar: محرر الملفات التفاف الكلمات إعادة التدفق الأسطر النص التمرير الأفقي المعاينة
bs: uređivač datoteka prelamanje riječi meko prelamanje ponovno slaganje redovi tekst vodoravno pomicanje pregled
da: fileditor orddeling blød ombrydning omflow linjer tekst vandret rulning forhåndsvisning
de: dateieditor zeilenumbruch weicher umbruch reflow zeilen text horizontales scrollen vorschau
es: editor de archivos ajuste de línea ajuste suave redistribuir líneas texto desplazamiento horizontal vista previa
fr: éditeur de fichiers retour à la ligne retour souple reflow lignes texte défilement horizontal aperçu
it: editor di file a capo automatico a capo morbido riflusso righe testo scorrimento orizzontale anteprima
ja: ファイルエディタ 行の折り返し ソフトラップ リフロー 行 テキスト 横スクロール プレビュー
ko: 파일 편집기 자동 줄 바꿈 소프트 랩 리플로 행 텍스트 가로 스크롤 미리보기
nb: fileditor tekstbryting myk bryting flyt linjer tekst vannrett rulling forhåndsvisning
pl: edytor plików zawijanie wierszy miękkie zawijanie przepływ wiersze tekst przewijanie poziome podgląd
pt_br: editor de arquivos quebra de linha quebra suave refluidez linhas texto rolagem horizontal visualização
ru: редактор файлов перенос строк мягкий перенос переразметка строки текст горизонтальная прокрутка предпросмотр
th: ตัวแก้ไขไฟล์ การตัดคำ การตัดบรรทัดแบบนุ่ม จัดเรียงบรรทัด ข้อความ เลื่อนแนวนอน แสดงตัวอย่าง
tr: dosya düzenleyici kelime kaydırma yumuşak kaydırma yeniden akış satırlar metin yatay kaydırma önizleme
uk: редактор файлів перенесення рядків м’яке перенесення переформатування рядки текст горизонтальне прокручування попередній перегляд
zh_hans: 文件编辑器 自动换行 软换行 重排 行 文本 横向滚动 预览
zh_hant: 檔案編輯器 自動換行 軟換行 重排 行 文字 水平捲動 預覽

# settings.search.fileEditor.syntaxHighlighting
source: syntax highlight colors tokens code
ar: تمييز بناء الجملة ألوان الرموز البرمجية
bs: isticanje sintakse boje tokeni kod
da: syntaksfremhævning farver tokens kode
de: syntaxhervorhebung farben token code
es: resaltado de sintaxis colores tokens código
fr: coloration syntaxique couleurs jetons code
it: evidenziazione sintassi colori token codice
ja: 構文ハイライト 色 トークン コード
ko: 구문 강조 색상 토큰 코드
nb: syntaksutheving farger token kode
pl: podświetlanie składni kolory tokeny kod
pt_br: realce de sintaxe cores tokens código
ru: подсветка синтаксиса цвета токены код
th: เน้นไวยากรณ์ สี โทเค็น โค้ด
tr: sözdizimi vurgulama renkler jetonlar kod
uk: підсвічування синтаксису кольори токени код
zh_hans: 语法高亮 颜色 标记 代码
zh_hant: 語法醒目提示 顏色 標記 程式碼

# settings.search.fileEditor.lineNumbers
source: gutter line numbers
ar: هامش أرقام الأسطر
bs: žlijeb brojevi redova
da: gutter linjenumre
de: gutter zeilennummern
es: margen números de línea
fr: gouttière numéros de ligne
it: gutter numeri di riga
ja: ガター 行番号
ko: 여백 줄 번호
nb: gutter linjenumre
pl: rynienka numery wierszy
pt_br: calha números de linha
ru: поле номера строк
th: แถบ เลขบรรทัด
tr: oluk satır numaraları
uk: жолоб номери рядків
zh_hans: 行号槽 行号
zh_hant: 行號欄 行號

# settings.search.fileEditor.indentGuides
source: indent guides columns
ar: أدلة المسافة البادئة أعمدة
bs: vodiči uvlačenja stupci
da: indrykningsguider kolonner
de: einzug hilfslinien spalten
es: guías de sangría columnas
fr: guides indentation colonnes
it: guide indentazione colonne
ja: インデント ガイド 列
ko: 들여쓰기 안내선 열
nb: innrykksguider kolonner
pl: prowadnice wcięć kolumny
pt_br: guias de recuo colunas
ru: направляющие отступа столбцы
th: เส้นนำการเยื้อง คอลัมน์
tr: girinti kılavuzları sütunlar
uk: напрямні відступу стовпці
zh_hans: 缩进参考线 列
zh_hant: 縮排參考線 欄

# settings.search.fileEditor.currentLineHighlight
source: current line caret highlight
ar: السطر الحالي المؤشر تمييز
bs: trenutni red karet isticanje
da: aktuel linje indsætningspunkt fremhævning
de: aktuelle zeile einfügemarke hervorhebung
es: línea actual cursor resaltado
fr: ligne active curseur surbrillance
it: riga corrente cursore evidenziazione
ja: 現在の行 キャレット ハイライト
ko: 현재 줄 캐럿 강조
nb: gjeldende linje innsettingspunkt utheving
pl: bieżący wiersz karetka podświetlenie
pt_br: linha atual cursor realce
ru: текущая строка каретка подсветка
th: บรรทัดปัจจุบัน แคร์เรต เน้น
tr: geçerli satır imleç vurgulama
uk: поточний рядок каретка підсвічування
zh_hans: 当前行 插入点 高亮
zh_hant: 目前行 插入點 醒目提示

# settings.search.fileEditor.tabWidth
source: tab width indent columns
ar: عرض علامة التبويب المسافة البادئة الأعمدة
bs: širina taba uvlačenje stupci
da: tabulatorbredde indrykning kolonner
de: tabulatorbreite einzug spalten
es: ancho de tabulación sangría columnas
fr: largeur tabulation indentation colonnes
it: larghezza tabulazione indentazione colonne
ja: タブ幅 インデント 列
ko: 탭 너비 들여쓰기 열
nb: tabulatorbredde innrykk kolonner
pl: szerokość tabulacji wcięcia kolumny
pt_br: largura da tabulação recuo colunas
ru: ширина табуляции отступ столбцы
th: ความกว้างแท็บ เยื้อง คอลัมน์
tr: sekme genişliği girinti sütunlar
uk: ширина табуляції відступ стовпці
zh_hans: 制表符宽度 缩进 列
zh_hant: 定位點寬度 縮排 欄

# cli.cloud.domains.confirmPublic
source: Public access lets anyone open %@ (VM %@, port %@). Continue? [y/N]
ar: يسمح الوصول العام لأي شخص بفتح %@ (الآلة الافتراضية VM %@، المنفذ %@). هل تريد الاستمرار؟ [y/N]
de: Öffentlicher Zugriff ermöglicht es jedem, %@ zu öffnen (VM %@, Port %@). Fortfahren? [j/N]
es: El acceso público permite que cualquiera abra %@ (VM %@, puerto %@). ¿Continuar? [s/N]
fr: L’accès public permet à quiconque d’ouvrir %@ (VM %@, port %@). Continuer ? [y/N]
ja: 公開すると誰でも%@（VM %@、ポート%@）にアクセスできます。続けますか？[y/N]
ko: 공공 액세스를 허용하면 누구나 %@(VM %@, 포트 %@)을(를) 열 수 있습니다. 계속하시겠습니까? [y/N]
zh_hans: 公开访问将允许任何人打开 %@（VM %@，端口 %@）。是否继续？[y/N]
zh_hant: 公開存取將允許任何人開啟 %@（虛擬機器 %@，連接埠 %@）。是否繼續？[y/N]

# cli.cloud.domains.publicCancelled
source: Public access was not enabled.
ar: لم يتم تمكين الوصول العام.
de: Öffentlicher Zugriff wurde nicht aktiviert.
es: El acceso público no fue habilitado.
fr: L’accès public n’a pas été activé.
ja: 公開アクセスは有効になっていません。
ko: 공공 액세스가 활성화되지 않았습니다.
zh_hans: 公开访问未启用。
zh_hant: 未啟用公開存取。

# cloudTree.port.forwardListenerFailed
source: cmux could not open a local port for the forward: %@
ar: لم يتمكن cmux من فتح منفذ محلي لإعادة التوجيه: %@
de: cmux konnte keinen lokalen Port für die Weiterleitung öffnen: %@
es: cmux no pudo abrir un puerto local para el reenvío: %@
fr: cmux n'a pas pu ouvrir un port local pour la redirection : %@
ja: cmux は転送用のローカルポートを開けませんでした: %@
ko: cmux가 포트 포워딩을 위한 로컬 포트를 열 수 없습니다: %@
zh_hans: cmux 无法为转发打开本地端口：%@
zh_hant: cmux 無法開啟用於轉送的本機連接埠：%@

# cloudTree.port.forwardListenerCancelled
source: The local port forward was closed before it started.
ar: تم إغلاق إعادة توجيه المنفذ المحلي قبل أن تبدأ.
de: Die lokale Portweiterleitung wurde geschlossen, bevor sie gestartet wurde.
es: El reenvío de puerto local se cerró antes de comenzar.
fr: La redirection de port local a été fermée avant de démarrer.
ja: ローカルポート転送は開始前に閉じられました。
ko: 로컬 포트 포워딩이 시작되기 전에 닫혔습니다.
zh_hans: 本地端口转发在启动前已被关闭。
zh_hant: 本機連接埠轉送在啟動前已關閉。

# cloudTree.port.noPort
source: %@ has no port to open.
ar: لا يحتوي %@ على منفذ لفتحه.
de: %@ hat keinen Port zum Öffnen.
es: %@ no tiene ningún puerto para abrir.
fr: %@ n'a aucun port à ouvrir.
ja: %@ には開くポートがありません。
ko: %@에 열 수 있는 포트가 없습니다.
zh_hans: %@ 没有要打开的端口。
zh_hant: %@ 沒有可開啟的連接埠。

# cloudTree.port.noPrivateAddress
source: %@ has no private network address yet; refresh the machine list and retry.
ar: لا يحتوي %@ على عنوان شبكة خاصة بعد؛ أعد تحميل قائمة الأجهزة وحاول مجددًا.
de: %@ hat noch keine private Netzwerkadresse; aktualisieren Sie die Maschinenliste und versuchen Sie es erneut.
es: %@ no tiene dirección de red privada aún; actualice la lista de máquinas y vuelva a intentarlo.
fr: %@ n'a pas encore d'adresse réseau privée ; actualisez la liste des machines et réessayez.
ja: %@ にはまだプライベートネットワークアドレスがありません。マシン一覧を更新して再試行してください。
ko: %@에 아직 사설 네트워크 주소가 없습니다. 머신 목록을 새로고침한 후 다시 시도하세요.
zh_hans: %@ 尚无私有网络地址；请刷新机器列表并重试。
zh_hant: %@ 尚無私人網路位址；請重新整理機器清單並重試。

# cloudTree.error.hubUnavailable
source: This cmux build has no user-space WireGuard hub, so it cannot reach ports on Cloud machines.
ar: لا يحتوي إصدار cmux هذا على موزع WireGuard في مساحة المستخدم، لذلك لا يمكنه الوصول إلى المنافذ على أجهزة Cloud.
de: Dieses cmux-Build verfügt über keinen User-Space-WireGuard-Hub, sodass Ports auf Cloud-Maschinen nicht erreicht werden können.
es: Esta compilación de cmux no tiene un hub WireGuard en espacio de usuario, por lo que no puede alcanzar puertos en máquinas de la nube.
fr: Cette version de cmux ne contient pas de hub WireGuard en espace utilisateur, elle ne peut donc pas atteindre les ports des machines Cloud.
ja: この cmux ビルドにはユーザー空間 WireGuard ハブがないため、クラウドマシンのポートに接続できません。
ko: 이 cmux 빌드에는 사용자 공간 WireGuard 허브가 없어 Cloud 머신의 포트에 접근할 수 없습니다.
zh_hans: 此 cmux 构建版本没有用户空间 WireGuard 集线器，因此无法访问云机器上的端口。
zh_hant: 此 cmux 版本沒有使用者空間的 WireGuard 集線器，因此無法連線到雲端機器上的連接埠。

# cloudTree.tunnel.connectedPinned
source: cmux Cloud Tunnel is on: every app on this Mac can reach your Cloud VM network. `cmux vpn down` turns it off.
ar: نفق cmux Cloud Tunnel قيد التشغيل: يمكن لكل تطبيق على جهاز Mac هذا الوصول إلى شبكة أجهزة Cloud VM الخاصة بك. الأمر `cmux vpn down` يقوم بإيقافه.
de: cmux Cloud Tunnel ist eingeschaltet: Jede App auf diesem Mac kann Ihr Cloud-VM-Netzwerk erreichen. Mit `cmux vpn down` wird er ausgeschaltet.
es: El Túnel en la nube de cmux está activo: cada aplicación en esta Mac puede alcanzar su red de VM en la nube. `cmux vpn down` lo desactiva.
fr: Le Tunnel Cloud cmux est activé : chaque application sur ce Mac peut atteindre votre réseau de VM Cloud. `cmux vpn down` le désactive.
ja: cmux クラウドトンネルはオンです。この Mac のすべてのアプリがクラウド VM ネットワークに到達できます。`cmux vpn down` でオフになります。
ko: cmux Cloud Tunnel이 켜져 있습니다: 이 Mac의 모든 앱이 Cloud VM 네트워크에 연결할 수 있습니다. `cmux vpn down`으로 끌 수 있습니다.
zh_hans: cmux 云隧道已开启：此 Mac 上的每个应用都可以访问您的云 VM 网络。`cmux vpn down` 可将其关闭。
zh_hant: cmux Cloud Tunnel 已啟用：這台 Mac 上的每個應用程式都可以存取您的 Cloud VM 網路。輸入 `cmux vpn down` 即可關閉。

# cloudTree.tunnel.connected
source: cmux Cloud Tunnel is on: every app on this Mac can reach your Cloud VM network. It stops on its own when idle.
ar: نفق cmux Cloud Tunnel قيد التشغيل: يمكن لكل تطبيق على جهاز Mac هذا الوصول إلى شبكة أجهزة Cloud VM الخاصة بك. يتوقف تلقائيًا عند الخمول.
de: cmux Cloud Tunnel ist eingeschaltet: Jede App auf diesem Mac kann Ihr Cloud-VM-Netzwerk erreichen. Er stoppt automatisch, wenn er inaktiv ist.
es: El Túnel en la nube de cmux está activo: cada aplicación en esta Mac puede alcanzar su red de VM en la nube. Se detiene solo cuando está inactivo.
fr: Le Tunnel Cloud cmux est activé : chaque application sur ce Mac peut atteindre votre réseau de VM Cloud. Il s'arrête de lui-même lorsqu'il est inactif.
ja: cmux クラウドトンネルはオンです。この Mac のすべてのアプリがクラウド VM ネットワークに到達できます。アイドル状態になると自動的に停止します。
ko: cmux Cloud Tunnel이 켜져 있습니다: 이 Mac의 모든 앱이 Cloud VM 네트워크에 연결할 수 있습니다. 유휴 상태가 되면 자동으로 중지됩니다.
zh_hans: cmux 云隧道已开启：此 Mac 上的每个应用都可以访问您的云 VM 网络。闲置时它会自行停止。
zh_hant: cmux Cloud Tunnel 已啟用：這台 Mac 上的每個應用程式都可以存取您的 Cloud VM 網路。閒置時會自動停止。

# cloudTree.tunnel.openSystemSettings
source: Open System Settings
ar: فتح إعدادات النظام
de: Systemeinstellungen öffnen
es: Abrir Ajustes del Sistema
fr: Ouvrir les Réglages Système
ja: システム設定を開く
ko: 시스템 설정 열기
zh_hans: 打开系统设置
zh_hant: 開啟系統設定

# cloudTree.tunnel.help
source: The cmux Cloud Tunnel is a macOS network extension that gives every app on this Mac a route to your Cloud VM network. cmux itself does not need it: terminals, Ports, and Desktop use the built-in user-space tunnel.
ar: نفق cmux Cloud Tunnel هو امتداد شبكة لنظام التشغيل macOS يمنح كل تطبيق على جهاز Mac هذا مسارًا إلى شبكة أجهزة Cloud VM الخاصة بك. لا يحتاج cmux نفسه إليه: تستخدم محطات الطرفية والمنافذ وسطح المكتب النفق المدمج في مساحة المستخدم.
de: Der cmux Cloud Tunnel ist eine macOS-Netzwerk-Extension, die jeder App auf diesem Mac eine Route zu Ihrem Cloud-VM-Netzwerk zuweist. cmux selbst benötigt diese nicht: Terminals, Ports und Desktop nutzen den integrierten User-Space-Tunnel.
es: El Túnel en la nube de cmux es una extensión de red de macOS que otorga a cada aplicación en esta Mac una ruta hacia su red de VM en la nube. cmux mismo no la necesita: las terminales, Puertos y Escritorio utilizan el túnel integrado en espacio de usuario.
fr: Le Tunnel Cloud cmux est une extension réseau macOS qui donne à chaque application sur ce Mac un accès à votre réseau de VM Cloud. cmux lui-même n'en a pas besoin : les terminaux, Ports et Desktop utilisent le tunnel en espace utilisateur intégré.
ja: cmux クラウドトンネルは、この Mac のすべてのアプリにクラウド VM ネットワークへの経路を与える macOS のネットワーク機能拡張です。cmux 自体には不要です。ターミナル、ポート、デスクトップは内蔵のユーザー空間トンネルを使います。
ko: cmux Cloud Tunnel은 이 Mac의 모든 앱에 Cloud VM 네트워크로 가는 경로를 제공하는 macOS 네트워크 확장 프로그램입니다. cmux 자체는 이것이 필요하지 않습니다: 터미널, Ports, Desktop은 내장된 사용자 공간 터널을 사용합니다.
zh_hans: cmux 云隧道是一个 macOS 网络扩展，它让此 Mac 上的每个应用都有一条通往您的云 VM 网络的路由。cmux 本身不需要它：终端、端口和桌面使用内置的用户空间隧道。
zh_hant: cmux Cloud Tunnel 是一個 macOS 網路延伸功能，可為這台 Mac 上的每個應用程式提供通往您的 Cloud VM 網路的路由。cmux 本身不需要它：終端機、Ports 和 Desktop 使用內建的使用者空間通道。
